teslabs/pebbleos/src/fw/drivers/nrf5/qspi.c
#include "drivers/qspi.h"

#include "board/board.h"
#include "drivers/dma.h"
#include "drivers/flash/flash_impl.h"
#include "drivers/flash/qspi_flash.h"
#include "drivers/flash/qspi_flash_definitions.h"
#include "drivers/gpio.h"
#include "drivers/periph_config.h"
#include "drivers/qspi_definitions.h"
#include "flash_region/flash_region.h"
#include "kernel/util/delay.h"
#include "kernel/util/sleep.h"
#include "kernel/util/stop.h"
#include "mcu/cache.h"
#include "system/logging.h"
#include "system/passert.h"
#include "util/math.h"
#include "services/common/new_timer/new_timer.h"
#include "os/mutex.h"
#include "drivers/clocksource.h"

#define NRF5_COMPATIBLE
#include <mcu.h>
#include <nrfx.h>
#include <nrfx_qspi.h>

#include "FreeRTOS.h"
#include "semphr.h"

/* For short reads that don't take very long, there isn't enough time to
 * do anything meaningful during a context switch; the requesting thread
 * ought just spin-wait.
 */
#define READ_POLLING_THRESHOLD 512

/* nRF5's QSPI controller is different enough from STM32's that we
 * reimplement qspi_flash.c, not stm32/qspi.c.  */

#define FLASH_RESET_WORD_VALUE (0xffffffff)

static uint8_t s_qspi_ram_buffer[32];

status_t flash_impl_set_nvram_erase_status(bool is_subsector, FlashAddress addr) {
  return S_SUCCESS;
}

status_t flash_impl_clear_nvram_erase_status(void) { return S_SUCCESS; }

status_t flash_impl_get_nvram_erase_status(bool *is_subsector, FlashAddress *addr) {
  // XXX
  return S_FALSE;
}

/*** QSPI sleep routines ***
 *
 * In the STM32 world, it is sufficient to just put the flash in DPD around
 * stop mode.  But on nRF52, it's actually not the flash that uses that much
 * power -- it's the flash *controller*!  Having the flash controller turned
 * on could cost as much as 800uA compared to the flash itself, which
 * probably is around 100 uA when not in DPD.
 *
 * We really want to shut it off ASAP, even if we're not in stop mode -- and
 * we definitely don't want to power it back up when we leave stop mode,
 * because powering it up is pretty slow (it requires turning on the HFXO in
 * order to be reliable).  So instead of using the PebbleOS "please enter
 * low power mode" hints, we set a new_timer of our own to power up on first
 * access, and then power down after 50ms of nobody talking to us.
 */

// Not too long that we're burning power, not too short that we're spending
// all our time turning the HFXO on and off.
#define FLASH_TIMEOUT_MS 50

// #define DEBUG_FLASH_SLEEP_TIME

static bool s_is_init = false;
static bool s_is_awake = false;
static int s_is_active = 0; // some QSPI functions are reentrant (like blank-check during erase), so this needs to not be a bool

static void prv_write_cmd_no_addr(QSPIPort *dev, uint8_t cmd);
static void _flash_handler(nrfx_qspi_evt_t event, void *ctx);

/* Unfortunately, new_timer is very slow to interface with (50us or more),
 * and even taking a PebbleMutex is very expensive (30us or more) -- and
 * flash operations happen a *lot*.
 *
 * So, when we start the timer to shut the flash back down, we really only
 * want to do that if we absolutely have to -- if the timer is already
 * running, it's so expensive to kick it out into the future that we'd
 * rather that it just retrigger on its own later, rather than having to
 * think about it on every single flash op.  (We encode that state into
 * s_timer_is_set and s_sleep_last_ticks.)
 *
 * We also avoid taking the s_sleep_mutex in the uncontended path of flash
 * accesses, for that is also quite expensive -- an atomic test-and-set
 * s_sleep_defer indicates whether `prv_use` is trying to turn on the flash
 * (and, therefore, `prv_sleep_timeout` must not turn it off), or vice
 * versa.  (See comments in each of these functions for the precise
 * synchronization sequence when it's necessary to "upgrade" from the
 * lightweight lock to the mutex.)
 */
static TimerID s_sleep_timer;
static RtcTicks s_sleep_last_ticks = 0; /* If we have woken recently, try again later. */
static bool s_sleep_timer_is_set = false;

static PebbleMutex *s_sleep_mutex;
static bool s_sleep_defer = false;

static void prv_sleep_timeout(void *arg) {
  QSPIFlash *dev = (QSPIFlash *)arg;
  RtcTicks now = rtc_get_ticks();
  if (s_is_active || dev->state->coredump_mode || ((s_sleep_last_ticks + FLASH_TIMEOUT_MS) > now)) {
    // the new_timer will come and try again later
    return;
  }

#ifdef DEBUG_FLASH_SLEEP_TIME
#  if defined(DEBUG_FLASH_SLEEP_TIME) && FLASH_LOG_LEVEL >= LOG_LEVEL_DEBUG
#    error you goofball, you cannot use the flash as a backing medium for logs debugging the flash.  turn down the log level!
#  endif

  PBL_LOG(LOG_LEVEL_DEBUG, "flash is going back to sleep");
#endif

  mutex_lock(s_sleep_mutex);
  bool sleep_is_deferred = __atomic_test_and_set(&s_sleep_defer, __ATOMIC_SEQ_CST);
  if (sleep_is_deferred) {
    /* We got interrupted at the exact moment that prv_use is trying to wake
     * prevent us from sleeping.  No problem -- the new_timer will come and
     * try again later.
     *
     * In the mean time, we do not "own" the s_sleep_defer, so we don't need
     * to clear it.
     */
    goto done_mutex;
  }

  new_timer_stop(s_sleep_timer);
  s_sleep_timer_is_set = false;

  if (!s_is_awake) {
    /* Nothing to do -- maybe we got errantly rescheduled (see comment in
     * prv_release).
     */
    goto done_defer;
  }

  prv_write_cmd_no_addr(dev->qspi, dev->state->part->instructions.enter_low_power);
  delay_us(dev->state->part->standby_to_low_power_latency_us);

  nrfx_qspi_deactivate();

  clocksource_hfxo_release();

  s_is_awake = false;

done_defer:
  __atomic_clear(&s_sleep_defer, __ATOMIC_SEQ_CST);
done_mutex:
  mutex_unlock(s_sleep_mutex);
}

static void prv_use(QSPIFlash *dev) {
  if (!dev->state->coredump_mode) {
    bool going_back_to_sleep;
    do {
      going_back_to_sleep = __atomic_test_and_set(&s_sleep_defer, __ATOMIC_SEQ_CST);
      if (going_back_to_sleep) {
        /* prv_sleep_timeout is currently putting us back to sleep.  Grab the
         * mutex to wait until they finish putting us back to sleep, then we'll
         * get back to work.
         */
        mutex_lock(s_sleep_mutex);
        mutex_unlock(s_sleep_mutex);
      }
    } while (!going_back_to_sleep);

    /* Now, we were the one responsible for setting the sleep_defer flag;
     * we'll clean it up when we're done, and prv_sleep_timeout will not
     * cause us trouble until we say that we're done.
     */
  }

  PBL_ASSERT(s_is_init, "QSPIFlash not initialized");
  s_is_active++;

  /* As soon as we're s_is_active, prv_sleep_timeout will not interrupt us
   * -- that's as good as being s_sleep_deferred.  Now we can clean that up.
   */
  __atomic_clear(&s_sleep_defer, __ATOMIC_SEQ_CST);

  s_sleep_last_ticks = rtc_get_ticks();

