teslabs/pebbleos/src/fw/drivers/nrf5/qspi.c
  if (s_is_awake) {
    /* sleep_timer might still be alive, but we don't want to ask
     * new_timer to do anything about it right now, since that's
     * expensive.  If it comes and we are s_is_active later, it'll just
     * reschedule itself.
     */
    return;
  }

#ifdef DEBUG_FLASH_SLEEP_TIME
  PBL_LOG(LOG_LEVEL_DEBUG, "flash is waking up");
#endif

  clocksource_hfxo_request();

  nrfx_err_t err;
  do {
    err = nrfx_qspi_activate(true /* wait */);
  } while (err != NRFX_SUCCESS);

  prv_write_cmd_no_addr(dev->qspi, dev->state->part->instructions.exit_low_power);
  delay_us(dev->state->part->low_power_to_standby_latency_us);

  s_is_awake = true;
}

static void prv_release(QSPIFlash *dev) {
  PBL_ASSERTN(s_is_active);
  s_is_active--;

  if (!dev->state->coredump_mode && !s_is_active && !s_sleep_timer_is_set) {
    /* Note that a previous new_timer could have come along just after we
     * decremented s_is_active, and then we would set a new new_timer
     * without noticing -- so the timeout CB needs to be aware of the
     * potential to be called without anyone ever having woken us.
     */
    s_sleep_timer_is_set = true;
    new_timer_start(s_sleep_timer, FLASH_TIMEOUT_MS, prv_sleep_timeout, (void *)dev, TIMER_START_FLAG_REPEATING);
  }
}

void qspi_flash_set_lower_power_mode(QSPIFlash *dev, bool active) {
  /* This is a no-op on nRF5, because do our own timer-based power
   * management to turn on and shut down not just the flash but the QSPI
   * controller also (which is way more expensive than the flash!).
   */
}

/*** Underlying small flash I/O helpers. ***/

static void prv_read_register(QSPIPort *dev, uint8_t instruction, uint8_t *data, uint32_t length) {
  nrf_qspi_cinstr_conf_t instr = NRFX_QSPI_DEFAULT_CINSTR(instruction, length + 1);
  instr.io2_level = true;
  instr.io3_level = true;
  nrfx_err_t err = nrfx_qspi_cinstr_xfer(&instr, NULL, data);
  PBL_ASSERTN(err == NRFX_SUCCESS);
}

static void prv_write_register(QSPIPort *dev, uint8_t instruction, const uint8_t *data,
                               uint32_t length) {
  nrf_qspi_cinstr_conf_t instr = NRFX_QSPI_DEFAULT_CINSTR(instruction, length + 1);
  instr.io2_level = true;
  instr.io3_level = true;
  instr.wren = true;
  nrfx_err_t err = nrfx_qspi_cinstr_xfer(&instr, data, NULL);
  PBL_ASSERTN(err == NRFX_SUCCESS);
}

static void prv_write_cmd_no_addr(QSPIPort *dev, uint8_t cmd) {
  nrf_qspi_cinstr_conf_t instr = NRFX_QSPI_DEFAULT_CINSTR(cmd, 1);
  instr.io2_level = true;
  instr.io3_level = true;
  nrfx_err_t err = nrfx_qspi_cinstr_xfer(&instr, NULL, NULL);
  PBL_ASSERTN(err == NRFX_SUCCESS);
}

static bool prv_poll_bit(QSPIPort *dev, uint8_t instruction, uint8_t bit_mask, bool should_be_set,
                         uint32_t timeout_us) {
  uint32_t loops = 0;
  uint8_t val;
  while (1) {
    prv_read_register(dev, instruction, &val, 1);
    if ((!!(val & bit_mask)) == should_be_set) break;
    if ((timeout_us != QSPI_NO_TIMEOUT) && (++loops > timeout_us)) {
      PBL_LOG(LOG_LEVEL_ERROR, "Timeout waiting for a bit!?!?");
      return false;
    }
    delay_us(1);
  }

  return true;
}

static void prv_write_enable(QSPIFlash *dev) {
  prv_write_cmd_no_addr(dev->qspi, dev->state->part->instructions.write_enable);
  // wait for writing to be enabled
  prv_poll_bit(dev->qspi, dev->state->part->instructions.rdsr1,
               dev->state->part->status_bit_masks.write_enable, true /* set */, QSPI_NO_TIMEOUT);
}

static void prv_wait_for_completion(QSPIFlash *dev) {
  if (!dev->state->coredump_mode) {
    xSemaphoreTake(dev->qspi->state->dma_semaphore, portMAX_DELAY);
  }
}

static bool prv_check_whoami(QSPIFlash *dev) {
  // The WHOAMI is 3 bytes
  const uint32_t whoami_length = 3;
  uint32_t read_whoami = 0;
  prv_read_register(dev->qspi, dev->state->part->instructions.qspi_id, (uint8_t *)&read_whoami,
                    whoami_length);

  if (read_whoami == dev->state->part->qspi_id_value) {
    PBL_LOG(LOG_LEVEL_INFO, "Flash is %s", dev->state->part->name);
    return true;
  } else {
    PBL_LOG(LOG_LEVEL_ERROR, "Flash isn't expected %s (whoami: 0x%" PRIx32 ")",
            dev->state->part->name, read_whoami);
    return false;
  }
}

bool qspi_flash_check_whoami(QSPIFlash *dev) {
  prv_use(dev);
  bool rv = prv_check_whoami(dev);
  prv_release(dev);
  return rv;
}

bool qspi_flash_is_in_coredump_mode(QSPIFlash *dev) { return dev->state->coredump_mode; }

static void _flash_handler(nrfx_qspi_evt_t event, void *ctx) {
  QSPIFlash *dev = (QSPIFlash *)ctx;
  BaseType_t woken = pdFALSE;

  PBL_ASSERTN(event == NRFX_QSPI_EVENT_DONE);

  if (dev->qspi->state->spin_waiting) {
    dev->qspi->state->spin_waiting = false;
  } else {
    xSemaphoreGiveFromISR(dev->qspi->state->dma_semaphore, &woken);
    portYIELD_FROM_ISR(woken);
  }
}

/*** Flash init routines. ***/

static void prv_configure_qe(QSPIFlash *dev) {
  uint8_t sr[2];

  // Check first if read/write mode requires QE to be set
  if (!(dev->read_mode == QSPI_FLASH_READ_READ2IO || dev->read_mode == QSPI_FLASH_READ_READ4O ||
        dev->read_mode == QSPI_FLASH_READ_READ4IO || dev->write_mode == QSPI_FLASH_WRITE_PP4O ||
        dev->write_mode == QSPI_FLASH_WRITE_PP4IO)) {
    return;
  }

  // Check if QE is needed
  if (dev->state->part->qer_type == JESD216_DW15_QER_NONE) {
    return;
  }

  // Enable QE bit
  switch (dev->state->part->qer_type) {
    case JESD216_DW15_QER_S1B6:
      prv_read_register(dev->qspi, dev->state->part->instructions.rdsr1, sr, 1);
      sr[0] |= (1 << 6);
      prv_write_register(dev->qspi, dev->state->part->instructions.wrsr, sr, 1);
      break;
    case JESD216_DW15_QER_S2B1v1:
    case JESD216_DW15_QER_S2B1v4:
    case JESD216_DW15_QER_S2B1v5:
      // Writing SR2 requires writing SR1 as well
      prv_read_register(dev->qspi, dev->state->part->instructions.rdsr1, &sr[0], 1);
      prv_read_register(dev->qspi, dev->state->part->instructions.rdsr2, &sr[1], 1);
      sr[1] |= (1 << 1);
      prv_write_register(dev->qspi, dev->state->part->instructions.wrsr, sr, 2);
      break;
    case JESD216_DW15_QER_S2B1v6:
      // We can write SR2 without writing SR1
      prv_read_register(dev->qspi, dev->state->part->instructions.rdsr2, sr, 1);
      sr[0] |= (1 << 1);
      prv_write_register(dev->qspi, dev->state->part->instructions.wrsr2, sr, 1);
      break;
    default:
      PBL_ASSERT(false, "Unsupported QER type %d", dev->state->part->qer_type);
  }
}

void qspi_flash_init(QSPIFlash *dev, QSPIFlashPart *part, bool coredump_mode) {
  dev->state->part = part;
  dev->state->coredump_mode = coredump_mode;

  // Init the DMA semaphore, used for I/O ops
  if (!coredump_mode) {
    dev->qspi->state->dma_semaphore = xSemaphoreCreateBinary();
    s_sleep_timer = new_timer_create();
    s_sleep_mutex = mutex_create();
  }

