teslabs/pebbleos/src/fw/drivers/nrf5/qspi.c
  nrfx_qspi_config_t config = NRFX_QSPI_DEFAULT_CONFIG(
      dev->qspi->clk_gpio, dev->qspi->cs_gpio, dev->qspi->data_gpio[0], dev->qspi->data_gpio[1],
      dev->qspi->data_gpio[2], dev->qspi->data_gpio[3]);
  config.phy_if.sck_freq = NRF_QSPI_FREQ_DIV4;

  switch (dev->read_mode) {
    case QSPI_FLASH_READ_READ2O:
      config.prot_if.readoc = NRF_QSPI_READOC_READ2O;
      break;
    case QSPI_FLASH_READ_READ2IO:
      config.prot_if.readoc = NRF_QSPI_READOC_READ2IO;
      break;
    case QSPI_FLASH_READ_READ4O:
      config.prot_if.readoc = NRF_QSPI_READOC_READ4O;
      break;
    case QSPI_FLASH_READ_READ4IO:
      config.prot_if.readoc = NRF_QSPI_READOC_READ4IO;
      break;
    default:
      config.prot_if.readoc = NRF_QSPI_READOC_FASTREAD;
      break;
  }

  switch (dev->write_mode) {
    case QSPI_FLASH_WRITE_PP2O:
      config.prot_if.writeoc = NRF_QSPI_WRITEOC_PP2O;
      break;
    case QSPI_FLASH_WRITE_PP4O:
      config.prot_if.writeoc = NRF_QSPI_WRITEOC_PP4O;
      break;
    case QSPI_FLASH_WRITE_PP4IO:
      config.prot_if.writeoc = NRF_QSPI_WRITEOC_PP4IO;
      break;
    default:
      config.prot_if.writeoc = NRF_QSPI_WRITEOC_PP;
      break;
  }

  if (dev->state->part->size > 0x1000000) {
    config.prot_if.addrmode = NRF_QSPI_ADDRMODE_32BIT;
  } else {
    config.prot_if.addrmode = NRF_QSPI_ADDRMODE_24BIT;
  }

  nrfx_err_t err;
  if (s_is_init) {
    nrfx_qspi_uninit();
  }
  err = nrfx_qspi_init(&config, coredump_mode ? NULL : _flash_handler, (void *)dev);
  PBL_ASSERTN(err == NRFX_SUCCESS);
  s_is_init = true;

  if (dev->reset_gpio.gpio) {
    WTF;
  }

  // Reset the flash to stop any program's or erase in progress from before reboot
  prv_write_cmd_no_addr(dev->qspi, dev->state->part->instructions.reset_enable);
  prv_write_cmd_no_addr(dev->qspi, dev->state->part->instructions.reset);

  if (coredump_mode) {
    delay_us(dev->state->part->reset_latency_ms * 1000);
  } else {
    psleep(dev->state->part->reset_latency_ms);
  }

  if (!coredump_mode) {
    prv_check_whoami(dev);
  }

  if (config.prot_if.addrmode == NRF_QSPI_ADDRMODE_32BIT) {
    prv_write_cmd_no_addr(dev->qspi, dev->state->part->instructions.en4b);
  }

  prv_configure_qe(dev);

  s_is_awake = true;

  if (!coredump_mode) {
    // We go to sleep right away so that we're in a consistent state --
    // someone will wake us up when they need to.
    prv_write_cmd_no_addr(dev->qspi, dev->state->part->instructions.enter_low_power);
    delay_us(dev->state->part->standby_to_low_power_latency_us);
    nrfx_qspi_deactivate();
    s_is_awake = false;
  }
}

/*** Actual underlying flash implementation. ***/

status_t qspi_flash_is_erase_complete(QSPIFlash *dev) {
  uint8_t status_reg;
  uint8_t flag_status_reg;

  prv_use(dev);

  prv_read_register(dev->qspi, dev->state->part->instructions.rdsr1, &status_reg, 1);
  prv_read_register(dev->qspi, dev->state->part->instructions.rdsr2, &flag_status_reg, 1);

  prv_release(dev);

  if (status_reg & dev->state->part->status_bit_masks.busy) {
    return E_BUSY;
  } else if (flag_status_reg & dev->state->part->flag_status_bit_masks.erase_suspend) {
    return E_AGAIN;
  } else {
    return S_SUCCESS;
  }
}

status_t qspi_flash_erase_begin(QSPIFlash *dev, uint32_t addr, bool is_subsector) {
  prv_use(dev);

  prv_write_enable(dev);

  nrfx_err_t err =
      nrfx_qspi_erase(is_subsector ? NRF_QSPI_ERASE_LEN_4KB : NRF_QSPI_ERASE_LEN_64KB, addr);
  PBL_ASSERTN(err == NRFX_SUCCESS);

  prv_wait_for_completion(dev);

  // wait for busy to be set indicating the erase has started
  const uint32_t busy_timeout_us = 500;
  const bool result =
      prv_poll_bit(dev->qspi, dev->state->part->instructions.rdsr1,
                   dev->state->part->status_bit_masks.busy, true /* set */, busy_timeout_us);

  prv_release(dev);

  return result ? S_SUCCESS : E_ERROR;
}

status_t qspi_flash_erase_suspend(QSPIFlash *dev, uint32_t addr) {
  uint8_t status_reg;

  prv_use(dev);

  prv_read_register(dev->qspi, dev->state->part->instructions.rdsr1, &status_reg, 1);
  if (!(status_reg & dev->state->part->status_bit_masks.busy)) {
    // no erase in progress
    prv_release(dev);
    return S_NO_ACTION_REQUIRED;
  }

  prv_write_cmd_no_addr(dev->qspi, dev->state->part->instructions.erase_suspend);

  if (dev->state->part->suspend_to_read_latency_us) {
    delay_us(dev->state->part->suspend_to_read_latency_us);
  }

  prv_release(dev);

  return S_SUCCESS;
}

void qspi_flash_erase_resume(QSPIFlash *dev, uint32_t addr) {
  prv_use(dev);

  prv_write_cmd_no_addr(dev->qspi, dev->state->part->instructions.erase_resume);
  // wait for the erase_suspend bit to be cleared
  prv_poll_bit(dev->qspi, dev->state->part->instructions.rdsr2,
               dev->state->part->flag_status_bit_masks.erase_suspend, false /* !set */,
               QSPI_NO_TIMEOUT);

  prv_release(dev);
}

void qspi_flash_read_blocking(QSPIFlash *dev, uint32_t addr, void *buffer, uint32_t length) {
  uint8_t __attribute__((aligned(4))) b_buf[4];
  uint8_t buf_pre;
  uint8_t buf_suf;
  uint32_t buf_mid;
  nrfx_err_t err;

  prv_use(dev);

  buf_pre = (4U - (uint8_t)((uint32_t)buffer % 4U)) % 4U;
  if (buf_pre > length) {
    buf_pre = length;
  }

  buf_suf = (uint8_t)((length - buf_pre) % 4U);
  buf_mid = length - buf_pre - buf_suf;

  if (buf_pre != 0U) {
    dev->qspi->state->spin_waiting = true;
    err = nrfx_qspi_read(b_buf, 4U, addr);
    while (dev->qspi->state->spin_waiting)
      ;
    PBL_ASSERTN(err == NRFX_SUCCESS);

    memcpy(buffer, b_buf, buf_pre);
    addr += buf_pre;
    buffer = ((uint8_t *)buffer) + buf_pre;
  }

  if (buf_mid != 0U) {
    if (length < READ_POLLING_THRESHOLD) {
      dev->qspi->state->spin_waiting = true;
      err = nrfx_qspi_read(buffer, buf_mid, addr);
      while (dev->qspi->state->spin_waiting)
        ;
    } else {
      err = nrfx_qspi_read(buffer, buf_mid, addr);
      prv_wait_for_completion(dev);
    }
    PBL_ASSERTN(err == NRFX_SUCCESS);

    addr += buf_mid;
    buffer = ((uint8_t *)buffer) + buf_mid;
  }

  if (buf_suf != 0U) {
    dev->qspi->state->spin_waiting = true;
    err = nrfx_qspi_read(b_buf, 4U, addr);
    while (dev->qspi->state->spin_waiting)
      ;
    PBL_ASSERTN(err == NRFX_SUCCESS);

    memcpy(buffer, b_buf, buf_suf);
  }

  prv_release(dev);
}

int qspi_flash_write_page_begin(QSPIFlash *dev, const void *buffer, uint32_t addr,
                                uint32_t length) {
  uint8_t __attribute__((aligned(4))) b_buf[4];
  uint8_t buf_pre;
  uint8_t buf_suf;
  uint32_t buf_mid;
  nrfx_err_t err;

  prv_use(dev);

  // we can write from start address up to the end of the page
  length = MIN(length, PAGE_SIZE_BYTES - (addr % PAGE_SIZE_BYTES));

  // bounce data to RAM if not in RAM
  if (!nrfx_is_in_ram(buffer)) {
    length = MIN(length, sizeof(s_qspi_ram_buffer));
    memcpy(s_qspi_ram_buffer, buffer, length);
    buffer = s_qspi_ram_buffer;
  }

  buf_pre = (4U - (uint8_t)((uint32_t)buffer % 4U)) % 4U;
  if (buf_pre > length) {
    buf_pre = length;
  }

  buf_suf = (uint8_t)((length - buf_pre) % 4U);
  buf_mid = length - buf_pre - buf_suf;

