teslabs/pebbleos/src/fw/drivers/nrf5/qspi.c
  prv_write_enable(dev);

  if (buf_pre != 0U) {
    memset(&b_buf[buf_pre], 0xff, sizeof(b_buf) - buf_pre);
    memcpy(b_buf, buffer, buf_pre);

    err = nrfx_qspi_write(b_buf, 4U, addr);
    prv_wait_for_completion(dev);
    PBL_ASSERTN(err == NRFX_SUCCESS);

    addr += buf_pre;
    buffer = ((uint8_t *)buffer) + buf_pre;
  }

  if (buf_mid != 0U) {
    while (nrfx_qspi_mem_busy_check() == NRFX_ERROR_BUSY) {
    }

    err = nrfx_qspi_write(buffer, buf_mid, addr);
    prv_wait_for_completion(dev);
    PBL_ASSERTN(err == NRFX_SUCCESS);

    addr += buf_mid;
    buffer = ((uint8_t *)buffer) + buf_mid;
  }

  if (buf_suf != 0U) {
    while (nrfx_qspi_mem_busy_check() == NRFX_ERROR_BUSY) {
    }

    memset(&b_buf[buf_suf], 0xff, 4U - buf_suf);
    memcpy(b_buf, buffer, buf_suf);

    err = nrfx_qspi_write(b_buf, 4U, addr);
    prv_wait_for_completion(dev);
    PBL_ASSERTN(err == NRFX_SUCCESS);
  }

  prv_release(dev);

  return length;
}

status_t qspi_flash_get_write_status(QSPIFlash *dev) {
  prv_use(dev);
  status_t rv = nrfx_qspi_mem_busy_check() == NRFX_SUCCESS ? S_SUCCESS : E_BUSY;
  prv_release(dev);
  return rv;
}


static bool prv_blank_check_poll(QSPIFlash *dev, uint32_t addr, bool is_subsector) {
  const uint32_t size_bytes = is_subsector ? SUBSECTOR_SIZE_BYTES : SECTOR_SIZE_BYTES;
  const uint32_t BUF_SIZE_BYTES = 128;
  const uint32_t BUF_SIZE_WORDS = BUF_SIZE_BYTES / sizeof(uint32_t);
  uint32_t buffer[BUF_SIZE_WORDS];
  for (uint32_t offset = 0; offset < size_bytes; offset += BUF_SIZE_BYTES) {
    flash_impl_read_sync(buffer, addr + offset, BUF_SIZE_BYTES);
    for (uint32_t i = 0; i < BUF_SIZE_WORDS; ++i) {
      if (buffer[i] != FLASH_RESET_WORD_VALUE) {
        return false;
      }
    }
  }
  return true;
}

status_t qspi_flash_blank_check(QSPIFlash *dev, uint32_t addr, bool is_subsector) {
  prv_use(dev);
  const bool result = prv_blank_check_poll(dev, addr, is_subsector);
  prv_release(dev);
  return result ? S_TRUE : S_FALSE;
}

void qspi_flash_ll_set_register_bits(QSPIFlash *dev, uint8_t read_instruction,
                                     uint8_t write_instruction, uint8_t value, uint8_t mask) {
  prv_use(dev);

  // make sure we're not trying to set any bits not within the mask
  PBL_ASSERTN((value & mask) == value);

  // first read the register
  uint8_t reg_value;
  prv_read_register(dev->qspi, read_instruction, &reg_value, 1);

  // set the desired bits
  reg_value = (reg_value & ~mask) | value;

  // enable writing and write the register value
  prv_write_cmd_no_addr(dev->qspi, dev->state->part->instructions.write_enable);
  qspi_indirect_write_no_addr(dev->qspi, write_instruction, &reg_value, 1);

  prv_release(dev);
}

status_t qspi_flash_write_protection_enable(QSPIFlash *dev) { return S_NO_ACTION_REQUIRED; }

status_t qspi_flash_lock_sector(QSPIFlash *dev, uint32_t addr) { return S_SUCCESS; }

status_t qspi_flash_unlock_all(QSPIFlash *dev) { return S_SUCCESS; }

status_t prv_qspi_security_register_check(QSPIFlash *dev, uint32_t addr) {
  bool addr_valid = false;

  if (dev->state->part->sec_registers.num_sec_regs == 0U) {
    return E_INVALID_OPERATION;
  }

  for (uint8_t i = 0U; i < dev->state->part->sec_registers.num_sec_regs; ++i) {
    if (addr >= dev->state->part->sec_registers.sec_regs[i] &&
        addr < dev->state->part->sec_registers.sec_regs[i] +
               dev->state->part->sec_registers.sec_reg_size) {
      addr_valid = true;
      break;
    }
  }

  if (!addr_valid) {
    return E_INVALID_ARGUMENT;
  }

  return S_SUCCESS;
}

status_t qspi_flash_read_security_register(QSPIFlash *dev, uint32_t addr, uint8_t *val) {
  status_t ret;
  nrfx_err_t err;
  nrf_qspi_cinstr_conf_t instr = NRFX_QSPI_DEFAULT_CINSTR(dev->state->part->instructions.read_sec, 0);
  uint8_t out[6];
  uint8_t in[6];

  prv_use(dev);

  ret = prv_qspi_security_register_check(dev, addr);
  if (ret != S_SUCCESS) {
    prv_release(dev);
    return ret;
  }

  instr.io2_level = true;
  instr.io3_level = true;

  if (dev->state->part->size > 0x1000000) {
    instr.length = 7;
    out[0] = (addr >> 24U);
    out[1] = (addr >> 16U) & 0xFFU;
    out[2] = (addr >> 8U) & 0xFFU;
    out[3] = addr & 0xFFU;
  } else {
    instr.length = 6;
    out[0] = (addr >> 16U) & 0xFFU;
    out[1] = (addr >> 8U) & 0xFFU;
    out[2] = addr & 0xFFU;
  }

  err = nrfx_qspi_cinstr_xfer(&instr, out, in);
  if (err != NRFX_SUCCESS) {
    prv_release(dev);
    return E_ERROR;
  }

  if (dev->state->part->size > 0x1000000) {
    *val = in[5];
  } else {
    *val = in[4];
  }

  prv_release(dev);

  return 0;
}

status_t qspi_flash_security_registers_are_locked(QSPIFlash *dev, bool *locked) {
  uint8_t sr2;

  prv_use(dev);

  prv_read_register(dev->qspi, dev->state->part->instructions.rdsr2, &sr2, 1);

  prv_release(dev);

  *locked = !!(sr2 & dev->state->part->flag_status_bit_masks.sec_lock);

  return 0;
}

status_t qspi_flash_erase_security_register(QSPIFlash *dev, uint32_t addr) {
  status_t ret;
  nrfx_err_t err;
  nrf_qspi_cinstr_conf_t instr = NRFX_QSPI_DEFAULT_CINSTR(dev->state->part->instructions.erase_sec, 0);
  uint8_t out[4];

  prv_use(dev);

  ret = prv_qspi_security_register_check(dev, addr);
  if (ret != S_SUCCESS) {
    prv_release(dev);
    return ret;
  }

  instr.io2_level = true;
  instr.io3_level = true;
  instr.wren = true;

  if (dev->state->part->size > 0x1000000) {
    instr.length = 5;
    out[0] = (addr >> 24U);
    out[1] = (addr >> 16U) & 0xFFU;
    out[2] = (addr >> 8U) & 0xFFU;
    out[3] = addr & 0xFFU;
  } else {
    instr.length = 4;
    out[0] = (addr >> 16U) & 0xFFU;
    out[1] = (addr >> 8U) & 0xFFU;
    out[2] = addr & 0xFFU;
  }

  err = nrfx_qspi_cinstr_xfer(&instr, out, NULL);
  if (err != NRFX_SUCCESS) {
    prv_release(dev);
    return E_ERROR;
  }

  while (nrfx_qspi_mem_busy_check() == NRFX_ERROR_BUSY) {
  }

  prv_release(dev);

  return 0;
}

status_t qspi_flash_write_security_register(QSPIFlash *dev, uint32_t addr, uint8_t val) {
  status_t ret;
  nrfx_err_t err;
  nrf_qspi_cinstr_conf_t instr = NRFX_QSPI_DEFAULT_CINSTR(dev->state->part->instructions.program_sec, 0);
  uint8_t out[5];

  prv_use(dev);

  ret = prv_qspi_security_register_check(dev, addr);
  if (ret != S_SUCCESS) {
    prv_release(dev);
    return ret;
  }

